# Importing

In [1]:
#importing data and libraries 
import pandas as pd
import numpy as np 
import os
path = r'C:\Users\Administrator\Desktop\Projects (Carrer foundry)\Achievement 4 (J)'
df_prods = pd.read_csv(os.path.join(path, '02 Data','Prepared Data','products_checked.csv'), index_col= False)
df_combined = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data','df_combined.pkl'))

## Start of the Exercise

In [2]:
#old code
# using if statement to define a function checking the price of a product
#def price_label(row):
  #if row['prices'] <= 5:
   # return 'Low-range product'
  #elif (row['prices'] > 5) and (row['prices'] <= 15):
    #return 'Mid-range product'
  #elif row['prices'] > 15:
   # return 'High range'
  #else: return 'Not enough data'
def price_label(row):
    price = row['prices']
    
    # Define a dictionary with price ranges as keys and product labels as values
    price_ranges = {
        (0, 5): 'Low-range product',
        (5, 15): 'Mid-range product',
        (15, float('inf')): 'High-range product'
    }

    # Check if price fits any of the defined ranges
    for price_range, label in price_ranges.items():
        if price_range[0] < price <= price_range[1]:
            return label
    
    # If no range is found, return 'Not enough data'
    return 'Not enough data'

In [3]:
# testing function on a subset
df = df_combined[:1000000]
df.shape

(1000000, 16)

In [4]:
df['price_range'] = df.apply(price_label, axis =1)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\2067299264.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['price_range'] = df.apply(price_label, axis =1)

In [5]:
df['price_range'].value_counts(dropna = False)

price_range
Mid-range product    673183
Low-range product    314392
High range            12425
Name: count, dtype: int64

In [6]:
df['prices'].max()

99999.0

## something is wrong here lets check

In [7]:
df.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,price_range
0,2539329,1,prior,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Mid-range product
1,2539329,1,prior,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both,Mid-range product
2,2539329,1,prior,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both,Low-range product
3,2539329,1,prior,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both,Low-range product
4,2539329,1,prior,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both,Low-range product

## no idea how the eval set got in there lets drop it agian

In [8]:
df_combined = df_combined.drop(['eval_set'], axis=1)

In [9]:
df_combined.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both

In [10]:
df_combined['prices'].max()

99999.0

In [11]:
# checking the cleaned products data for the same error
df_prods['prices'].max()

99999.0

In [12]:
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [13]:
df_prods[df_prods['product_name'].isnull()==True]

Empty DataFrame
Columns: [Unnamed: 0, product_id, product_name, aisle_id, department_id, prices]
Index: []

In [14]:
#error is there so double checking the shape is the same as the example in 4.4, which it is
df_prods.shape

(49672, 6)

In [15]:
#checking what is too highly priced
df_prods[df_prods['prices'] == 99999.0]

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
33649,33666,33664,2 % Reduced Fat Milk,84,16,99999.0

In [16]:
rows_too_large = df_prods[df_prods['prices'] > 15.0]

In [17]:
rows_too_large.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
16,16,17,Rendered Duck Fat,35,12,17.1
33,34,35,Italian Herb Porcini Mushrooms Chicken Sausage,106,12,15.1
38,39,40,Beef Hot Links Beef Smoked Sausage With Chile ...,106,12,22.5
81,83,84,Lamb Shank,7,12,24.3
171,174,175,T Bone Steak,122,12,18.6

In [18]:
#thought it through and checked for all outliers indstead of just one and found two clear errors
price_check=rows_too_large.sort_values(by='prices', ascending=False)
price_check.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
33649,33666,33664,2 % Reduced Fat Milk,84,16,99999.0
21538,21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
25564,25580,25579,Naturally Smoked Trout Fillet,15,12,25.0
21452,21468,21467,Wild Caught Raw Shrimp,15,12,25.0
40469,40490,40486,Chicken Tenders,49,12,25.0

## I have literally no Idea what has happened my df_prods matches the one in the example in 4.4, but clearly the milk and the cottage cheese need to be dropped for accuracies sake

In [19]:
df_combined2 = df_combined[~df_combined['prices'].isin([99999.0, 14900.0])]

In [20]:
df_combined2['prices'].max()

25.0

## okay now we have removed the outliers in the data weird they were there in the first place, but now on to the rest of the lesson

In [21]:
df = df_combined2[:1000000]
df['prices'].max()

25.0

## all the code looks correct so far, but I have values largers than 15 in my subset which looking into the origingal products df implies that the example code ordered the product df by price before merging. Which is weird, but forging on ahead as all the code portions are accurate

In [22]:
df.loc[df['prices'] > 15, 'price_range_loc'] = 'High-range product'
df.loc[(df['prices'] <= 15) & (df['prices'] > 5), 'price_range_loc'] = 'Mid-range product' 
df.loc[df['prices'] <= 5, 'price_range_loc'] = 'Low-range product'
df['price_range_loc'].value_counts(dropna = False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\931533412.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[df['prices'] > 15, 'price_range_loc'] = 'High-range product'

price_range_loc
Mid-range product     673293
Low-range product     314432
High-range product     12275
Name: count, dtype: int64

## still getting the warning which is weird, maybe a newer form of python is causing it

In [23]:
for x in range(30, 45):
    print("My age is %d" % (x))

My age is 30
My age is 31
My age is 32
My age is 33
My age is 34
My age is 35
My age is 36
My age is 37
My age is 38
My age is 39
My age is 40
My age is 41
My age is 42
My age is 43
My age is 44

In [24]:
#using the old combined to match the example with the no removed rows
df_combined['order_dow'].value_counts(dropna  = False)

order_dow
0    6204182
1    5660230
6    4496490
2    4213830
5    4205791
3    3840534
4    3783802
Name: count, dtype: int64

## switching back over to combined2

In [25]:
result = []

for value in df_combined2["order_dow"]:
  if value == 0:
    result.append("Busiest day")
  elif value == 4:
    result.append("Least busy")
  else:
    result.append("Regularly busy")

In [ ]:
result

In [27]:
df_combined2['busiest_day'] = result
df_combined2['busiest_day'].value_counts(dropna =  False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\3127499708.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_combined2['busiest_day'] = result

busiest_day
Regularly busy    22413231
Busiest day        6203329
Least busy         3783172
Name: count, dtype: int64

In [30]:
df_combined2.loc[df_combined2['prices'] > 15, 'price_range_loc'] = 'High-range product'
df_combined2.loc[(df_combined2['prices'] <= 15) & (df['prices'] > 5), 'price_range_loc'] = 'Mid-range product' 
df_combined2.loc[df_combined2['prices'] <= 5, 'price_range_loc'] = 'Low-range product'

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\1778974415.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_combined2.loc[df_combined2['prices'] > 15, 'price_range_loc'] = 'High-range product'

In [31]:
df_combined2.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,busiest_day,price_range_loc
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Regularly busy,Mid-range product
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both,Regularly busy,Mid-range product
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both,Regularly busy,Low-range product
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both,Regularly busy,Low-range product
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both,Regularly busy,Low-range product

## okay everthing is setup in the correct order and df_combined2 is ready to be worked on

#  Begin Task 4.7

In [37]:
result2 = []

for value in df_combined2["order_dow"]:
  if value == 0 or value == 1:
    result2.append("Busiest day")
  elif value == 4 or value == 3:
    result2.append("Least busy")
  else:
    result2.append("Regularly busy")

In [38]:
#checking the results of the loop
df_combined2['busiest_day'] = result2
df_combined2['busiest_day'].value_counts(dropna =  False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\3526532317.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_combined2['busiest_day'] = result2

busiest_day
Regularly busy    12914068
Busiest day       11862627
Least busy         7623037
Name: count, dtype: int64

## for this I just used the or command that I learned in java and assumed python has to include the second busiest day and second least busiest days. Looks like I was right and it works.

# Step 3 checking accuracy

In [39]:
df_combined2['order_dow'].value_counts(dropna  = False)

order_dow
0    6203329
1    5659298
6    4495887
2    4213105
5    4205076
3    3839865
4    3783172
Name: count, dtype: int64

In [40]:
x = 6203329+5659298
y = 3783172+3839865
print(x, y, sep=', ')

11862627, 7623037

## the numbers are a match to the expected output meaning the loop worked correctly. I don't fully understand the format of the order days of the week column, why is the smaller the number the busier it is? That aside code is good.

# Step 4 Busiest time of day

In [42]:
df_combined2['order_hour_of_day'].value_counts(dropna=False)

order_hour_of_day
10    2761333
11    2735694
14    2688728
15    2661718
13    2660570
12    2618104
16    2534744
9     2453842
17    2087273
8     1717863
18    1636226
19    1258076
20     976000
7      890923
21     795528
22     634159
23     402272
6      290450
0      218742
1      115683
5       87944
2       69360
4       53232
3       51268
Name: count, dtype: int64

In [43]:
result3 = []

for value in df_combined2["order_hour_of_day"]:
  if value in range(9, 16):
    result3.append("Most orders")
  elif value in range(3, 5):
    result3.append("Fewest orders")
  else:
    result3.append("Average orders")

In [44]:
#checking the results of the loop
df_combined2['busiest_period_of_day'] = result3
df_combined2['busiest_period_of_day'].value_counts(dropna =  False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\2677380307.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_combined2['busiest_period_of_day'] = result3

busiest_period_of_day
Most orders       18579989
Average orders    13715243
Fewest orders       104500
Name: count, dtype: int64

In [51]:
#Expected output
x  = 2761333+2735694+2688728+2661718+2660570+2618104+2534744+2453842
y = 87944+69360+53232+51268
print(x, y, sep=', ')

21114733, 261804

## something is wrong trying to see what values are being cut off

In [46]:
x  = 2735694+2688728+2661718+2660570+2618104+2534744
y = 69360+53232
print(x, y, sep=', ')

15899558, 122592

In [47]:
x  = 2761333+2735694+2688728+2661718+2660570+2618104+2534744
y = 87944+69360+53232
print(x, y, sep=', ')

18660891, 210536

## When looking into the error it looks like range does not include the last integer so the list is currently cutting off hours 16 and 5. We can fix this by increasing the range.

In [52]:
result3 = []

for value in df_combined2["order_hour_of_day"]:
  if value in range(9, 17):
    result3.append("Most orders")
  elif value in range(2, 6):
    result3.append("Fewest orders")
  else:
    result3.append("Average orders")

In [53]:
#rechecking the results of the loop
df_combined2['busiest_period_of_day'] = result3
df_combined2['busiest_period_of_day'].value_counts(dropna =  False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21604\1142162929.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_combined2['busiest_period_of_day'] = result3

busiest_period_of_day
Most orders       21114733
Average orders    11023195
Fewest orders       261804
Name: count, dtype: int64

## this matchs the expected output in line 45 so we are good. This is also the answer to step 5

In [54]:
df_combined2.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,busiest_day,price_range_loc,busiest_period_of_day
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Regularly busy,Mid-range product,Average orders
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both,Regularly busy,Mid-range product,Average orders
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both,Regularly busy,Low-range product,Average orders
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both,Regularly busy,Low-range product,Average orders
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both,Regularly busy,Low-range product,Average orders

# it's clear some earlier changes haven't stuck so doing them again here to export

In [55]:
df3 = df_combined2.rename(columns={'order_dow': 'orders_day_of_week'})
df3.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,busiest_day,price_range_loc,busiest_period_of_day
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Regularly busy,Mid-range product,Average orders
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both,Regularly busy,Mid-range product,Average orders
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both,Regularly busy,Low-range product,Average orders
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both,Regularly busy,Low-range product,Average orders
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both,Regularly busy,Low-range product,Average orders

In [56]:
df3 = df3.astype({'order_id': 'str', 'user_id': 'str'})

In [57]:
df3.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge,busiest_day,price_range_loc,busiest_period_of_day
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both,Regularly busy,Mid-range product,Average orders
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both,Regularly busy,Mid-range product,Average orders
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both,Regularly busy,Low-range product,Average orders
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both,Regularly busy,Low-range product,Average orders
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both,Regularly busy,Low-range product,Average orders

## Exporting new changes

In [58]:
df3.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'df_combined.pkl'))

In [2]:
df_combined.shape()

NameError: name 'df_combined' is not defined